const express = require("express");
const app = express();
const port = 5000;

app.get('/', function (req, res) {
	res.send('hello world!!');
  });
  
app.listen(port, () => console.log(`${port}포트입니다.`));
  
// 몽구스 연결

// 1. mongoose 모듈 가져오기
// https://javafa.gitbooks.io/nodejs_server_basic/content/chapter12.html
// https://www.geeksforgeeks.org/mongoose-insertmany-function/
// excel to json
// http://shancarter.github.io/mr-data-converter/
var mongoose = require('mongoose');
// 2. testDB 세팅
mongoose.connect('mongodb+srv://passionatel:0ez8kwW6i4sPRC2v@cluster0.dxzb4w2.mongodb.net/test');
// 3. 연결된 testDB 사용
var db = mongoose.connection;
// 4. 연결 실패
db.on('error', function(){
    console.log('Connection Failed!');
});
// 5. 연결 성공
db.once('open', function() {
    console.log('Connected!');
});

// 6. Schema 생성. (혹시 스키마에 대한 개념이 없다면, 입력될 데이터의 타입이 정의된 DB 설계도 라고 생각하면 됩니다.)
// 수정
const User = mongoose.model('test', {
    지점번호: { type: String },
    구간: { type: String },
	이정: { type: String },
    차로수: { type: String },
	노선번호: { type: String },
    도: { type: String },
	시군: { type: String },
    구읍면: { type: String },
    동리: { type: String }
});

// Function call
User.insertMany(
    [{"지점번호":"00132-1","구간":"안성IC - 안성JCT","이정":"360.5~365.3","차로수":8,"노선번호":1,"도":"경기","시군":"안성","구읍면":"공도","동리":"용두"},
{"지점번호":"133","구간":"안성JCT - 오산IC","이정":"365.3~378.6","차로수":8,"노선번호":1,"도":"경기","시군":"평택","구읍면":" ","동리":"월곡"},
{"지점번호":"134","구간":"오산IC - 동탄JCT","이정":"378.6~382.5","차로수":8,"노선번호":1,"도":"경기","시군":"오산","구읍면":" ","동리":"원"},
{"지점번호":"00134-1","구간":"동탄JCT - 기흥IC","이정":"382.5~387.6","차로수":8,"노선번호":1,"도":"경기","시군":"화성","구읍면":"동탄","동리":"방교"},
{"지점번호":"135","구간":"기흥IC - 수원신갈IC","이정":"387.6~392.7","차로수":8,"노선번호":1,"도":"경기","시군":"용인","구읍면":"기흥","동리":"고매"},
{"지점번호":"136","구간":"수원신갈IC - 신갈JCT","이정":"392.7~395.4","차로수":10,"노선번호":1,"도":"경기","시군":"용인","구읍면":"기흥","동리":"보라"},
{"지점번호":"137","구간":"신갈JCT - 판교JCT","이정":"395.4~408.5","차로수":8,"노선번호":1,"도":"경기","시군":"용인","구읍면":"기흥","동리":"상갈"},
{"지점번호":"00137-1","구간":"판교JCT - 금토JCT","이정":"408.5~409.8","차로수":10,"노선번호":1,"도":"경기","시군":"성남","구읍면":"분당","동리":"삼평"},
{"지점번호":"139","구간":"금토JCT - 양재IC","이정":"409.8~416.6","차로수":10,"노선번호":1,"도":"경기","시군":"성남","구읍면":"수정","동리":"금토"},
{"지점번호":"1523","구간":"서평택IC - 서평택JCT","이정":"281.1~287.6","차로수":6,"노선번호":15,"도":"경기","시군":"평택","구읍면":"포승","동리":"석정"},
{"지점번호":"01523-1","구간":"서평택JCT - 발안IC","이정":"287.6~295.4","차로수":6,"노선번호":15,"도":"경기","시군":"평택","구읍면":"청북","동리":"고잔"},
{"지점번호":"1524","구간":"발안IC - 비봉IC","이정":"295.4~309","차로수":6,"노선번호":15,"도":"경기","시군":"화성","구읍면":"팔탄","동리":"매곡"},
{"지점번호":"1525","구간":"비봉IC - 매송IC","이정":"309~313","차로수":8,"노선번호":15,"도":"경기","시군":"화성","구읍면":"비봉","동리":"구포"},
{"지점번호":"1526","구간":"매송IC - 팔곡JCT","이정":"313~316.8","차로수":6,"노선번호":15,"도":"경기","시군":"화성","구읍면":"매송","동리":"송라"},
{"지점번호":"1527","구간":"팔곡JCT - 안산JCT","이정":"316.8~321.9","차로수":6,"노선번호":15,"도":"경기","시군":"안산","구읍면":"상록","동리":"팔곡1"},
{"지점번호":"1528","구간":"안산JCT - 조남JCT","이정":"321.9~324.8","차로수":11,"노선번호":15,"도":"경기","시군":"안산","구읍면":"상록","동리":"부곡"},
{"지점번호":"1529","구간":"조남JCT - 목감IC","이정":"324.8~328","차로수":10,"노선번호":15,"도":"경기","시군":"시흥","구읍면":" ","동리":"조남"},
{"지점번호":"1530","구간":"목감IC - 광명역IC","이정":"328~329.2","차로수":10,"노선번호":15,"도":"경기","시군":"시흥","구읍면":" ","동리":"목감"},
{"지점번호":"01530-1","구간":"광명역IC - 일직JCT","이정":"329.2~331.9","차로수":10,"노선번호":15,"도":"경기","시군":"안양","구읍면":"만안","동리":"박달"},
{"지점번호":"1531","구간":"일직JCT - 소하JCT","이정":"331.9~332.9","차로수":8,"노선번호":15,"도":"경기","시군":"광명","구읍면":" ","동리":"소하"},
{"지점번호":"1532","구간":"소하JCT - 금천IC","이정":"332.9~336.1","차로수":4,"노선번호":15,"도":"서울","시군":" ","구읍면":"금천","동리":"시흥"},
{"지점번호":"1701","구간":"오성 - 평택JCT","이정":"0.9~2.6","차로수":6,"노선번호":17,"도":"경기","시군":"평택","구읍면":"오성","동리":"양교"},
{"지점번호":"1702","구간":"평택JCT - 어연IC","이정":"2.6~5.3","차로수":6,"노선번호":17,"도":"경기","시군":"평택","구읍면":"청북","동리":"어연"},
{"지점번호":"1703","구간":"어연IC - 양감IC","이정":"5.3~10","차로수":6,"노선번호":17,"도":"경기","시군":"화성","구읍면":"양감","동리":"용소"},
{"지점번호":"01703-1","구간":"양감IC - 향남IC","이정":"10~13.8","차로수":6,"노선번호":17,"도":"경기","시군":"화성","구읍면":"양감","동리":"송산"},
{"지점번호":"1704","구간":"향남IC - 서오산JCT","이정":"13.8~19.1","차로수":6,"노선번호":17,"도":"경기","시군":"화성","구읍면":"정남","동리":"금복"},
{"지점번호":"1705","구간":"서오산JCT - 정남IC","이정":"19.1~21.8","차로수":6,"노선번호":17,"도":"경기","시군":"화성","구읍면":"정남","동리":"관항"},
{"지점번호":"1706","구간":"정남IC - 봉담IC","이정":"21.8~27.6","차로수":4,"노선번호":17,"도":"경기","시군":"화성","구읍면":"봉담","동리":"와우"},
{"지점번호":"01706-1","구간":"봉담IC - 금곡IC","이정":"0~5.8","차로수":4,"노선번호":17.2,"도":"경기","시군":"화성","구읍면":"매송","동리":"천천"},
{"지점번호":"1707","구간":"금곡IC - 동안산·당수IC","이정":"5.8~8.8","차로수":4,"노선번호":17.2,"도":"경기","시군":"수원","구읍면":"권선","동리":"당수"},
{"지점번호":"1708","구간":"동안산·당수IC - 남군포IC","이정":"8.8~11.4","차로수":4,"노선번호":17.2,"도":"경기","시군":"수원","구읍면":"권선","동리":"당수"},
{"지점번호":"1709","구간":"남군포IC - 동시흥JCT","이정":"11.4~20.8","차로수":6,"노선번호":17.2,"도":"경기","시군":"군포","구읍면":" ","동리":"부곡"},
{"지점번호":"1710","구간":"동시흥JCT - 성채·소하IC","이정":"20.8~27.7","차로수":6,"노선번호":17.2,"도":"경기","시군":"광명","구읍면":" ","동리":"가학"},
{"지점번호":"2901","구간":"남구리IC - 중랑IC","이정":"0~5.3","차로수":6,"노선번호":29,"도":"경기","시군":" ","구읍면":"중랑","동리":"망우"},
{"지점번호":"2902","구간":"중랑IC - 남별내IC","이정":"5.3~12.6","차로수":6,"노선번호":29,"도":"경기","시군":"남양주","구읍면":"퇴계원","동리":"퇴계원"},
{"지점번호":"2903","구간":"남별내IC - 동의정부IC","이정":"12.6~19.2","차로수":6,"노선번호":29,"도":"경기","시군":"남양주","구읍면":"별내","동리":"광전"},
{"지점번호":"2904","구간":"동의정부IC - 민락IC","이정":"19.2~22.5","차로수":6,"노선번호":29,"도":"경기","시군":"의정부","구읍면":" ","동리":"산곡"},
{"지점번호":"2905","구간":"민락IC - 소흘IC","이정":"22.5~28.4","차로수":6,"노선번호":29,"도":"경기","시군":"의정부","구읍면":" ","동리":"자일"},
{"지점번호":"2906","구간":"소흘IC - 소흘JCT","이정":"28.4~30.6","차로수":6,"노선번호":29,"도":"경기","시군":"포천","구읍면":"소흘","동리":"무봉"},
{"지점번호":"02906-1","구간":"소흘JCT - 옥정IC","이정":"44.8~49","차로수":4,"노선번호":29,"도":"경기","시군":"포천","구읍면":"소흘","동리":"송우"},
{"지점번호":"02906-2","구간":"옥정IC - 양주IC","이정":"49~50.8","차로수":4,"노선번호":29,"도":"경기","시군":"양주","구읍면":" ","동리":"회암"},
{"지점번호":"2907","구간":"소흘JCT - 선단IC","이정":"30.6~35.1","차로수":4,"노선번호":29,"도":"경기","시군":"포천","구읍면":"소흘","동리":"이가팔"},
{"지점번호":"2908","구간":"선단IC - 포천IC","이정":"35.1~41.1","차로수":4,"노선번호":29,"도":"경기","시군":"포천","구읍면":"군내","동리":"유교"},
{"지점번호":"2909","구간":"포천IC - 신북IC","이정":"41.1~44.8","차로수":4,"노선번호":29,"도":"경기","시군":"포천","구읍면":"군내","동리":"하성북"},
{"지점번호":"03527-1","구간":"일죽IC - 남이천IC","이정":"274.9~285.6","차로수":4,"노선번호":35,"도":"경기","시군":"안성","구읍면":"일죽","동리":"고은"},
{"지점번호":"3528","구간":"남이천IC - 호법JCT","이정":"285.6~291.6","차로수":4,"노선번호":35,"도":"경기","시군":"이천","구읍면":"호법","동리":"송갈"},
{"지점번호":"3529","구간":"호법JCT - 마장JCT","이정":"291.6~294","차로수":8,"노선번호":35,"도":"경기","시군":"이천","구읍면":"호법","동리":"안평"},
{"지점번호":"3530","구간":"마장JCT - 서이천IC","이정":"294~297.3","차로수":4,"노선번호":35,"도":"경기","시군":"이천","구읍면":"마장","동리":"표교"},
{"지점번호":"3531","구간":"서이천IC - 곤지암IC","이정":"297.3~308","차로수":4,"노선번호":35,"도":"경기","시군":"이천","구읍면":"마장","동리":"장암"},
{"지점번호":"3532","구간":"곤지암IC - 경기광주JCT","이정":"308~311.1","차로수":4,"노선번호":35,"도":"경기","시군":"광주","구읍면":"실촌","동리":"삼"},
{"지점번호":"03532-1","구간":"경기광주JCT - 경기광주IC","이정":"311.1~320.1","차로수":4,"노선번호":35,"도":"경기","시군":"광주","구읍면":"초월","동리":"선동"},
{"지점번호":"3533","구간":"경기광주IC - 산곡JCT","이정":"320.1~325","차로수":4,"노선번호":35,"도":"경기","시군":"광주","구읍면":"중부","동리":"상번천"},
{"지점번호":"3534","구간":"산곡JCT - 하남IC","이정":"325~330.2","차로수":8,"노선번호":35,"도":"경기","시군":"하남","구읍면":" ","동리":"상산곡"},
{"지점번호":"3535","구간":"하남IC - 하남JCT","이정":"330.2~332.6","차로수":10,"노선번호":35,"도":"경기","시군":"하남","구읍면":" ","동리":"천현"},
{"지점번호":"3701","구간":"마장JCT - 경기광주JCT","이정":"293.8~310.4","차로수":4,"노선번호":37,"도":"경기","시군":"이천","구읍면":"마장","동리":"표교"},
{"지점번호":"3702","구간":"경기광주JCT - 산곡JCT","이정":"310.4~324.9","차로수":4,"노선번호":37,"도":"경기","시군":"광주","구읍면":"초월","동리":"지월"},
{"지점번호":"4001","구간":"서평택JCT - 청북IC","이정":"0~2.8","차로수":6,"노선번호":40,"도":"경기","시군":"평택","구읍면":"청북","동리":"고잔"},
{"지점번호":"4002","구간":"청북IC - 평택JCT","이정":"2.8~8","차로수":6,"노선번호":40,"도":"경기","시군":"평택","구읍면":"청북","동리":"삼계"},
{"지점번호":"04002-1","구간":"평택JCT - 평택고덕IC","이정":"8~13.7","차로수":6,"노선번호":40,"도":"경기","시군":"평택","구읍면":"오성","동리":"양교"},
{"지점번호":"04002-2","구간":"평택고덕IC - 송탄IC","이정":"13.7~20.9","차로수":6,"노선번호":40,"도":"경기","시군":"평택","구읍면":"고덕","동리":"궁리"},
{"지점번호":"4003","구간":"송탄IC - 안성JCT","이정":"20.9~23.7","차로수":6,"노선번호":40,"도":"경기","시군":"안성","구읍면":"원곡","동리":"내가천"},
{"지점번호":"4004","구간":"안성JCT - 서안성IC","이정":"23.7~25.7","차로수":6,"노선번호":40,"도":"경기","시군":"안성","구읍면":"원곡","동리":"외가천"},
{"지점번호":"4005","구간":"서안성IC - 남안성IC","이정":"25.7~35.9","차로수":4,"노선번호":40,"도":"경기","시군":"안성","구읍면":"원곡","동리":"반제"},
{"지점번호":"4006","구간":"남안성IC - 북진천IC","이정":"35.9~55.8","차로수":4,"노선번호":40,"도":"경기","시군":"안성","구읍면":"미양","동리":"보체"},
{"지점번호":"4512","구간":"여주JCT - 남여주IC","이정":"265.6~267.9","차로수":4,"노선번호":45,"도":"경기","시군":"여주","구읍면":"가남","동리":"본두"},
{"지점번호":"04512-1","구간":"남여주IC - 서여주IC","이정":"267.9~273.7","차로수":4,"노선번호":45,"도":"경기","시군":"여주","구읍면":"능서","동리":"구양"},
{"지점번호":"4513","구간":"서여주IC - 북여주IC","이정":"273.7~283.1","차로수":4,"노선번호":45,"도":"경기","시군":"여주","구읍면":"능서","동리":"구양"},
{"지점번호":"4514","구간":"북여주IC - 남양평하이패스IC","이정":"283.1~296.6","차로수":4,"노선번호":45,"도":"경기","시군":"양평","구읍면":"옥천","동리":"아신"},
{"지점번호":"04514-1","구간":"남양평하이패스IC - 양평IC","이정":"296.6~301.6","차로수":4,"노선번호":45,"도":"경기","시군":"양평","구읍면":"옥천","동리":"아신"},
{"지점번호":"5002","구간":"서창JCT - 월곶JCT","이정":"0~6","차로수":6,"노선번호":50,"도":"인천","시군":" ","구읍면":"남동","동리":"서창"},
{"지점번호":"5003","구간":"월곶JCT - 군자JCT","이정":"6~8","차로수":6,"노선번호":50,"도":"경기","시군":"시흥","구읍면":" ","동리":"월곶"},
{"지점번호":"05003-1","구간":"군자JCT - 서안산IC","이정":"8~12.6","차로수":6,"노선번호":50,"도":"경기","시군":"시흥","구읍면":" ","동리":"거모"},
{"지점번호":"5004","구간":"서안산IC - 안산IC","이정":"12.6~15.9","차로수":6,"노선번호":50,"도":"경기","시군":"안산","구읍면":"단원","동리":"선부"},
{"지점번호":"5005","구간":"안산IC - 안산JCT","이정":"15.9~18","차로수":9,"노선번호":50,"도":"경기","시군":"안산","구읍면":"상록","동리":"양상"},
{"지점번호":"5006","구간":"안산JCT - 둔대JCT","이정":"18~22.8","차로수":6,"노선번호":50,"도":"경기","시군":"안산","구읍면":"상록","동리":"부곡"},
{"지점번호":"05006-1","구간":"둔대JCT - 군포IC","이정":"22.8~24.5","차로수":6,"노선번호":50,"도":"경기","시군":"군포","구읍면":" ","동리":"둔대"},
{"지점번호":"5007","구간":"군포IC - 동군포IC","이정":"24.5~26.1","차로수":6,"노선번호":50,"도":"경기","시군":"군포","구읍면":" ","동리":"대야미"},
{"지점번호":"5008","구간":"동군포IC - 부곡IC","이정":"26.1~28.1","차로수":6,"노선번호":50,"도":"경기","시군":"의왕","구읍면":" ","동리":"부곡"},
{"지점번호":"5009","구간":"부곡IC - 북수원IC","이정":"28.1~30.9","차로수":6,"노선번호":50,"도":"경기","시군":"의왕","구읍면":" ","동리":"삼"},
{"지점번호":"5010","구간":"북수원IC - 동수원IC","이정":"30.9~37","차로수":8,"노선번호":50,"도":"경기","시군":"수원","구읍면":"장안","동리":"파장"},
{"지점번호":"5011","구간":"동수원IC - 신갈JCT","이정":"37~41.9","차로수":8,"노선번호":50,"도":"경기","시군":"수원","구읍면":"영통","동리":"이의"},
{"지점번호":"5012","구간":"신갈JCT - 마성IC","이정":"41.9~48.5","차로수":10,"노선번호":50,"도":"경기","시군":"용인","구읍면":"기흥","동리":"신갈"},
{"지점번호":"5013","구간":"마성IC - 용인IC","이정":"48.5~52.6","차로수":10,"노선번호":50,"도":"경기","시군":"용인","구읍면":"포곡","동리":"마성"},
{"지점번호":"5014","구간":"용인IC - 양지IC","이정":"52.6~60.6","차로수":8,"노선번호":50,"도":"경기","시군":"용인","구읍면":"처인","동리":"유방"},
{"지점번호":"5015","구간":"양지IC - 덕평IC","이정":"60.6~67.7","차로수":8,"노선번호":50,"도":"경기","시군":"용인","구읍면":"양지","동리":"양지"},
{"지점번호":"5016","구간":"덕평IC - 호법JCT","이정":"67.7~73.4","차로수":8,"노선번호":50,"도":"경기","시군":"이천","구읍면":"마장","동리":"각평"},
{"지점번호":"5017","구간":"호법JCT - 이천IC","이정":"73.4~79.8","차로수":8,"노선번호":50,"도":"경기","시군":"이천","구읍면":"호법","동리":"안평"},
{"지점번호":"5018","구간":"이천IC - 여주JCT","이정":"79.8~88.5","차로수":8,"노선번호":50,"도":"경기","시군":"이천","구읍면":"대월","동리":"사동"},
{"지점번호":"05018-1","구간":"여주JCT - 여주IC","이정":"88.5~94.7","차로수":4,"노선번호":50,"도":"경기","시군":"여주","구읍면":"가남","동리":"본두"},
{"지점번호":"5019","구간":"여주IC - 문막IC","이정":"94.7~114.7","차로수":4,"노선번호":50,"도":"경기","시군":"여주","구읍면":" ","동리":"점봉"},
{"지점번호":"5201","구간":"초월IC·경기광주JCT - 동곤지암IC","이정":"0~8.3","차로수":4,"노선번호":52,"도":"경기","시군":"광주","구읍면":"초월","동리":"학동"},
{"지점번호":"5202","구간":"동곤지암IC - 흥천이포IC","이정":"8.3~18.5","차로수":4,"노선번호":52,"도":"경기","시군":"여주","구읍면":"산북","동리":"도곡"},
{"지점번호":"5203","구간":"흥천이포IC - 대신IC","이정":"18.5~24.5","차로수":4,"노선번호":52,"도":"경기","시군":"여주","구읍면":"대신","동리":"보통"},
{"지점번호":"5204","구간":"대신IC - 동여주IC","이정":"24.5~33.1","차로수":4,"노선번호":52,"도":"경기","시군":"여주","구읍면":"대신","동리":"장풍"},
{"지점번호":"5205","구간":"동여주IC - 동양평IC","이정":"33.1~40.3","차로수":4,"노선번호":52,"도":"경기","시군":"여주","구읍면":"북내","동리":"서원"},
{"지점번호":"6001","구간":"강일JCT - 선동IC","이정":"0~1","차로수":8,"노선번호":60.2,"도":"서울","시군":" ","구읍면":"강동","동리":"강일"},
{"지점번호":"6002","구간":"선동IC - 미사IC","이정":"1~2","차로수":8,"노선번호":60.2,"도":"경기","시군":"하남","구읍면":" ","동리":"선"},
{"지점번호":"6003","구간":"미사IC - 덕소삼패IC","이정":"2~4","차로수":6,"노선번호":60.2,"도":"경기","시군":"하남","구읍면":" ","동리":"망월"},
{"지점번호":"6004","구간":"덕소삼패IC - 화도IC","이정":"4~14.9","차로수":6,"노선번호":60.2,"도":"경기","시군":"남양주","구읍면":" ","동리":"삼패"},
{"지점번호":"6005","구간":"화도IC - 서종IC","이정":"14.9~20.2","차로수":4,"노선번호":60.2,"도":"경기","시군":"남양주","구읍면":"화도","동리":"차산"},
{"지점번호":"6006","구간":"서종IC - 설악IC","이정":"20.2~33.1","차로수":4,"노선번호":60.2,"도":"경기","시군":"양평","구읍면":"서종","동리":"수입"},
{"지점번호":"6007","구간":"설악IC - 강촌IC","이정":"33.1~47.3","차로수":4,"노선번호":60.2,"도":"경기","시군":"가평","구읍면":"설악","동리":"신천"},
{"지점번호":"10001","구간":"판교JCT - 성남IC","이정":"0~4.2","차로수":8,"노선번호":100,"도":"경기","시군":"성남","구읍면":"분당","동리":"삼평"},
{"지점번호":"10002","구간":"성남IC - 송파IC","이정":"4.2~9.4","차로수":8,"노선번호":100,"도":"경기","시군":"성남","구읍면":"중원","동리":"성남"},
{"지점번호":"10003","구간":"송파IC - 서하남IC","이정":"9.4~14.4","차로수":8,"노선번호":100,"도":"서울","시군":" ","구읍면":"송파","동리":"장지"},
{"지점번호":"10004","구간":"서하남IC - 하남JCT","이정":"14.4~19.4","차로수":8,"노선번호":100,"도":"경기","시군":"하남","구읍면":" ","동리":"감일"},
{"지점번호":"10005","구간":"하남JCT - 상일IC","이정":"19.4~21.9","차로수":8,"노선번호":100,"도":"경기","시군":"하남","구읍면":" ","동리":"춘궁"},
{"지점번호":"10006","구간":"상일IC - 강일IC","이정":"21.9~24.9","차로수":8,"노선번호":100,"도":"서울","시군":" ","구읍면":"강동","동리":"상일"},
{"지점번호":"10007","구간":"강일IC - 토평IC","이정":"24.9~25.9","차로수":8,"노선번호":100,"도":"서울","시군":" ","구읍면":"강동","동리":"하일"},
{"지점번호":"10008","구간":"토평IC - 남양주IC","이정":"25.9~28.3","차로수":8,"노선번호":100,"도":"경기","시군":"구리","구읍면":" ","동리":"토평"},
{"지점번호":"10009","구간":"남양주IC - 구리IC","이정":"28.3~30.2","차로수":8,"노선번호":100,"도":"경기","시군":"남양주","구읍면":" ","동리":"도농"},
{"지점번호":"10010","구간":"구리IC - 퇴계원IC","이정":"30.2~32.9","차로수":8,"노선번호":100,"도":"경기","시군":"구리","구읍면":" ","동리":"인창"},
{"지점번호":"10011","구간":"학의JCT - 판교JCT","이정":"118.5~127.3","차로수":8,"노선번호":100,"도":"경기","시군":"의왕","구읍면":" ","동리":"학의"},
{"지점번호":"10012","구간":"평촌IC - 학의JCT","이정":"115.6~118.5","차로수":8,"노선번호":100,"도":"경기","시군":"안양","구읍면":" ","동리":"평촌"},
{"지점번호":"10013","구간":"산본IC - 평촌IC","이정":"111.5~115.6","차로수":8,"노선번호":100,"도":"경기","시군":"군포","구읍면":" ","동리":"산본"},
{"지점번호":"10014","구간":"조남JCT - 산본IC","이정":"106.2~111.5","차로수":8,"노선번호":100,"도":"경기","시군":"안양","구읍면":" ","동리":"안양"},
{"지점번호":"10015","구간":"안현JCT - 도리JCT","이정":"97~101.8","차로수":8,"노선번호":100,"도":"경기","시군":"시흥","구읍면":" ","동리":"안현"},
{"지점번호":"10015-1","구간":"도리JCT - 조남JCT","이정":"101.8~106.2","차로수":8,"노선번호":100,"도":"경기","시군":"시흥","구읍면":" ","동리":"조남"},
{"지점번호":"10016","구간":"시흥IC - 안현JCT","이정":"94.3~97","차로수":8,"노선번호":100,"도":"경기","시군":"시흥","구읍면":" ","동리":"대야"},
{"지점번호":"10017","구간":"장수IC - 시흥IC","이정":"90.1~94.3","차로수":8,"노선번호":100,"도":"인천","시군":" ","구읍면":"부평","동리":"구산"},
{"지점번호":"10018","구간":"송내IC - 장수IC","이정":"87.7~90.1","차로수":8,"노선번호":100,"도":"경기","시군":"부천","구읍면":"소사","동리":"송내"},
{"지점번호":"10019","구간":"중동IC - 송내IC","이정":"85.7~87.7","차로수":8,"노선번호":100,"도":"경기","시군":"부천","구읍면":"원미","동리":"중동"},
{"지점번호":"10020","구간":"서운JCT - 중동IC","이정":"83.6~85.7","차로수":8,"노선번호":100,"도":"인천","시군":" ","구읍면":"부평","동리":"서운"},
{"지점번호":"10021","구간":"계양IC - 서운JCT","이정":"81.3~83.6","차로수":8,"노선번호":100,"도":"인천","시군":" ","구읍면":"계양","동리":"병방"},
{"지점번호":"10022","구간":"노오지JCT - 계양IC","이정":"78.3~81.3","차로수":8,"노선번호":100,"도":"인천","시군":" ","구읍면":"계양","동리":"귤현"},
{"지점번호":"10023","구간":"김포IC - 노오지JCT","이정":"74.5~78.3","차로수":8,"노선번호":100,"도":"경기","시군":"김포","구읍면":"고촌","동리":"신곡"},
{"지점번호":"10024","구간":"자유로JCT - 김포IC","이정":"71.4~74.5","차로수":8,"노선번호":100,"도":"경기","시군":"고양","구읍면":"덕양","동리":"토당"},
{"지점번호":"10025","구간":"일산IC - 자유로JCT","이정":"69.2~71.4","차로수":10,"노선번호":100,"도":"경기","시군":"고양","구읍면":"덕양","동리":"내곡"},
{"지점번호":"10026","구간":"고양IC - 일산IC","이정":"65.9~69.2","차로수":8,"노선번호":100.2,"도":"경기","시군":"고양","구읍면":"일산동","동리":"산황"},
{"지점번호":"10027","구간":"통일로IC - 고양IC","이정":"59.9~65.9","차로수":8,"노선번호":100.2,"도":"경기","시군":"고양","구읍면":"덕양","동리":"주교"},
{"지점번호":"10028","구간":"송추IC - 통일로IC","이정":"51~59.9","차로수":8,"노선번호":100.2,"도":"경기","시군":"양주","구읍면":"장흥","동리":"삼하"},
{"지점번호":"10029","구간":"호원IC - 송추IC","이정":"44.5~51","차로수":8,"노선번호":100.2,"도":"경기","시군":"양주","구읍면":"장흥","동리":"울대"},
{"지점번호":"10029-1","구간":"의정부IC - 호원IC","이정":"42.9~44.5","차로수":8,"노선번호":100.2,"도":"경기","시군":"의정부","구읍면":" ","동리":"호원"},
{"지점번호":"10030","구간":"별내IC - 의정부IC","이정":"34.9~42.9","차로수":8,"노선번호":100.2,"도":"경기","시군":"남양주","구읍면":" ","동리":"화접"},
{"지점번호":"10031","구간":"퇴계원IC - 별내IC","이정":"32.9~34.9","차로수":8,"노선번호":100.2,"도":"경기","시군":"남양주","구읍면":" ","동리":"화접"},
{"지점번호":"11000","구간":"공항신도시JCT - 학익JCT","이정":"0~21.4","차로수":6,"노선번호":110.2,"도":"경기","시군":"인천","구읍면":"중","동리":"운남"},
{"지점번호":"11001","구간":"인천시점 - 학익JCT","이정":"0~1.8","차로수":6,"노선번호":110,"도":"인천","시군":" ","구읍면":"남","동리":"용현"},
{"지점번호":"11001-1","구간":"학익JCT - 문학IC","이정":"1.8~4.1","차로수":6,"노선번호":110,"도":"인천","시군":" ","구읍면":"남","동리":"학익"},
{"지점번호":"11002","구간":"문학IC - 남동IC","이정":"4.1~7.5","차로수":6,"노선번호":110,"도":"인천","시군":" ","구읍면":"남","동리":"문학"},
{"지점번호":"11003","구간":"남동IC - 서창JCT","이정":"7.5~9.8","차로수":8,"노선번호":110,"도":"인천","시군":" ","구읍면":"남동","동리":"남촌"},
{"지점번호":"11004","구간":"서창JCT - 신천IC","이정":"9.8~13.6","차로수":6,"노선번호":110,"도":"인천","시군":" ","구읍면":"남동","동리":"서창"},
{"지점번호":"11005","구간":"신천IC - 안현JCT","이정":"13.6~17","차로수":6,"노선번호":110,"도":"경기","시군":"시흥","구읍면":" ","동리":"방산"},
{"지점번호":"11006","구간":"안현JCT - 광명IC","이정":"17~20","차로수":6,"노선번호":110,"도":"경기","시군":"시흥","구읍면":" ","동리":"안현"},
{"지점번호":"11007","구간":"광명IC - 일직JCT","이정":"20~24.4","차로수":6,"노선번호":110,"도":"경기","시군":"광명","구읍면":" ","동리":"노온사"},
{"지점번호":"11008","구간":"일직JCT - 석수IC","이정":"24.4~25.4","차로수":6,"노선번호":110,"도":"경기","시군":"광명","구읍면":" ","동리":"일직"},
{"지점번호":"11009","구간":"석수IC - 삼막IC","이정":"0~1.2","차로수":6,"노선번호":110.3,"도":"경기","시군":"안양","구읍면":"만안","동리":"석수"},
{"지점번호":"11010","구간":"삼막IC - 북의왕IC","이정":"1.2~9.6","차로수":6,"노선번호":110.3,"도":"경기","시군":"안양","구읍면":"동안","동리":"비산"},
{"지점번호":"11011","구간":"북의왕IC - 북청계IC","이정":"9.6~10.8","차로수":6,"노선번호":110.3,"도":"경기","시군":"의왕","구읍면":" ","동리":"청계"},
{"지점번호":"11012","구간":"북청계IC - 동판교IC","이정":"10.8~20.2","차로수":4,"노선번호":110.3,"도":"경기","시군":"의왕","구읍면":" ","동리":"청계"},
{"지점번호":"11013","구간":"동판교IC - 여수대로IC","이정":"20.2~21.9","차로수":4,"노선번호":110.3,"도":"경기","시군":"성남","구읍면":"수정","동리":"시흥"},
{"지점번호":"12004","구간":"서인천IC - 부평IC","이정":"0~3.8","차로수":8,"노선번호":120,"도":"인천","시군":" ","구읍면":"서","동리":"가정"},
{"지점번호":"12005","구간":"부평IC - 서운JCT","이정":"3.8~6.9","차로수":8,"노선번호":120,"도":"인천","시군":" ","구읍면":"계양","동리":"작전"},
{"지점번호":"12006","구간":"서운JCT - 부천IC","이정":"6.9~8.6","차로수":8,"노선번호":120,"도":"인천","시군":" ","구읍면":"계양","동리":"서운"},
{"지점번호":"12007","구간":"부천IC - 신월IC","이정":"8.6~13.5","차로수":8,"노선번호":120,"도":"경기","시군":"부천","구읍면":"오정","동리":"내"},
{"지점번호":"13001","구간":"인천공항 - 공항신도시IC","이정":"0~1.6","차로수":8,"노선번호":130,"도":"인천","시군":" ","구읍면":"중","동리":"운서"},
{"지점번호":"13001-1","구간":"공항신도시IC - 공항입구JCT","이정":"1.6~4.6","차로수":8,"노선번호":130,"도":"인천","시군":" ","구읍면":"중","동리":"운서"},
{"지점번호":"13002","구간":"공항입구JCT - 북인천IC","이정":"4.6~15.7","차로수":8,"노선번호":130,"도":"인천","시군":" ","구읍면":"서","동리":"중산"},
{"지점번호":"13003","구간":"북인천IC - 청라IC","이정":"15.7~20.3","차로수":8,"노선번호":130,"도":"인천","시군":" ","구읍면":"서","동리":"경서"},
{"지점번호":"13003-1","구간":"청라IC - 노오지JCT","이정":"20.3~28.2","차로수":8,"노선번호":130,"도":"인천","시군":" ","구읍면":"계양","동리":"시천"},
{"지점번호":"13004","구간":"노오지JCT - 김포공항IC","이정":"28.2~32","차로수":6,"노선번호":130,"도":"인천","시군":" ","구읍면":"강서","동리":"상야"},
{"지점번호":"13005","구간":"김포공항IC - 88JCT","이정":"32~34.2","차로수":6,"노선번호":130,"도":"서울","시군":" ","구읍면":"덕양","동리":"개화"},
{"지점번호":"13005-1","구간":"88JCT - 북로JCT","이정":"34.2~36.5","차로수":6,"노선번호":130,"도":"경기","시군":" ","구읍면":"덕양","동리":"강매"},
{"지점번호":"15301","구간":"서평택JCT - 조암IC","이정":"0~8.3","차로수":4,"노선번호":153,"도":"경기","시군":"화성","구읍면":"장안","동리":"독정"},
{"지점번호":"15302","구간":"조암IC - 송산마도IC","이정":"8.3~25.6","차로수":4,"노선번호":153,"도":"경기","시군":"화성","구읍면":"우정","동리":"주곡"},
{"지점번호":"15303","구간":"송산마도IC - 남안산IC","이정":"25.6~34.5","차로수":4,"노선번호":153,"도":"경기","시군":"화성","구읍면":"송산","동리":"고정"},
{"지점번호":"15304","구간":"남안산IC - 군자JCT","이정":"34.5~42.6","차로수":6,"노선번호":153,"도":"경기","시군":"시흥","구읍면":" ","동리":"거모"},
{"지점번호":"17101","구간":"서오산JCT - 안녕IC","이정":"0~2.6","차로수":6,"노선번호":171,"도":"경기","시군":"오산","구읍면":" ","동리":"양산"},
{"지점번호":"17111","구간":"흥덕IC - 광교상현IC","이정":"0~3.2","차로수":6,"노선번호":171.2,"도":"경기","시군":"용인","구읍면":"기흥","동리":"영덕"},
{"지점번호":"17112","구간":"광교상현IC - 서수지IC","이정":"3.1~6.3","차로수":6,"노선번호":171.2,"도":"경기","시군":"용인","구읍면":"수지","동리":"성복"},
{"지점번호":"17113","구간":"서수지IC - 서분당IC","이정":"6.3~10.5","차로수":6,"노선번호":171.2,"도":"경기","시군":"용인","구읍면":"수지","동리":"신봉"},
{"지점번호":"17114","구간":"서분당IC - 서판교IC","이정":"10.5~13.6","차로수":6,"노선번호":171.2,"도":"경기","시군":"성남","구읍면":"분당","동리":"대장"},
{"지점번호":"17115","구간":"서판교IC - 고등IC","이정":"13.6~18.4","차로수":6,"노선번호":171.2,"도":"경기","시군":"성남","구읍면":"수정","동리":"금토"},
{"지점번호":"17116","구간":"고등IC - 헌릉IC","이정":"18.4~22.9","차로수":4,"노선번호":171.2,"도":"경기","시군":"성남","구읍면":"수정","동리":"고등"},
{"지점번호":"40001","구간":"동탄JCT - 북오산IC","이정":"0~3.7","차로수":4,"노선번호":400,"도":"경기","시군":"화성","구읍면":"동탄","동리":"금곡"},
{"지점번호":"40002","구간":"북오산IC - 서오산JCT","이정":"3.7~9.3","차로수":4,"노선번호":400,"도":"경기","시군":"오산","구읍면":" ","동리":"지곶"},
{"지점번호":"40003","구간":"시점IC - 남청라IC","이정":"0~9.2","차로수":6,"노선번호":400.2,"도":"인천","시군":" ","구읍면":"서","동리":"원창"},
{"지점번호":"40004","구간":"남청라IC - 북청라IC","이정":"9.2~14.3","차로수":6,"노선번호":400.2,"도":"인천","시군":" ","구읍면":"서","동리":"경서"},
{"지점번호":"40005","구간":"북청라IC - 검단양촌IC","이정":"14.3~19.1","차로수":6,"노선번호":400.2,"도":"인천","시군":" ","구읍면":"서","동리":"오류"},
{"지점번호":"40006","구간":"검단양촌IC - 대곶IC","이정":"19.1~24.7","차로수":4,"노선번호":400.2,"도":"경기","시군":"김포","구읍면":"양촌","동리":"학운"},
{"지점번호":"40007","구간":"대곶IC - 서김포통진IC","이정":"24.7~28.6","차로수":4,"노선번호":400.2,"도":"경기","시군":"김포","구읍면":"대곶","동리":"오니산"}]
).then(function(){
    console.log("Data inserted")  // Success
}).catch(function(error){
    console.log(error)      // Failure
});

app.get("/", (req,res) => {  
    res.sendFile(__dirname + '/index.html'); 
  });


  // (+) db에 저장된 데이터들 console.log로 확인하기
  app.get('/', function (req, res) {

	db.collection('tests').find().toArray(function(에러, 결과){
		console.log(결과);
	});

	res.send('hello world!!');
  });
